In [172]:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

### average income of alaska in all years

In [173]:
s=0
c=0
for i in range(2,11):
    s+=income.values[1][i]
    c+=1
    avg=s/c
print(avg)

60106.555555555555

### Average income of all states in 2012

In [24]:
s=0
c=0
for i in income.values:
        s+=i[9]
        c+=1
        avg=s/c
print(avg)

50038.8

### create a function to print all the columns in a single line:

In [27]:
def columns():
    return income.columns
columns()

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

### create a function to access a row based on a unique column value

In [145]:
print(income.values[0])

['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
 41381]

### create a function to find average income of all states from 2005 to 2013

In [30]:
def allStates():
    s=0
    c=0
    for i in range(2,11):
        for j in range(0,5):
            s+=income.values[j][i]
            c+=1
            avg=s/c
    return avg
allStates()

48525.42222222222

### create a function to find the highest average in the last three years:
## method1

In [35]:
def highest():
    s1=0
    s2=0
    s3=0
    c1=0
    c2=0
    c3=0
    for i in income.values:
        s1+=i[9]
        c1+=1
        avg2012=s1/c1
    for i in income.values:
        s2+=i[8]
        c2+=1
        avg2011=s2/c2
    for i in income.values:
        s3+=i[10]
        c3+=1
        avg2013=s3/c3
    print(avg2011)
    
    print(avg2012)
    print(avg2013)
    if(avg2011 > avg2012 and avg2011 >avg2013):
        print("2011 is highest")
    elif(avg2012>avg2013 and avg2012>avg2011):
        print("2012 is highest")
    else:
        print("2013 is highest")
highest()

48662.2
50038.8
50113.4
2013 is highest

### method2

In [76]:
def highest1():
    for i in range(8,11):
        s=0
        c=0
        h=0
        for j in range(0,5):
            s+=income.values[j][i]
            c+=1
            avg=s//c
        
        if h<avg:
            h=avg
    return h
highest1()

50113

In [77]:
h

47709.4

### calculate the lowest average income from 2007 to 2010(Inclusive)

In [84]:
def lowest():
    l=[]
    for i in range(4,8):
        s=0
        c=0
        for j in range(0,5):
            s+=income.values[j][i]
            c+=1
        avg=s/c
        print(avg)
        l.append(avg)
    return min(l)
lowest()

49789.8
50395.8
47999.0
47709.4

47709.4

### Print the list of all states in the same line with average income less than california

In [137]:
def california():
    l=[]
    l2=[]
    for i in range(0,5):
        s=0
        c=0
        for j in range(2,11):
            s+=income.values[i][j]
            c+=1
        avg=s//c
        l.append(avg)
    for k in range(0,4):
        if(l[k]<l[4]):
            for z in range(1,2):
                l2.append(income.values[k][z])
        
    print(l2) 
california()

['Alabama', 'Arizona', 'Arkansas']

### Print the names of states based on descending order of their averages

In [191]:
   
l4=[]
l5=[]
for i in range(0,5):
    s=0
    c=0
    for j in range(2,11):
        s+=income.values[i][j]
        c+=1
        avg=s//c
    l4.append(avg)
    l4.sort(reverse=True)
print(l4)

[60106, 55350, 47214, 41126, 38828]

### State the lowest recorded income from 2005 to 2013

In [144]:
def lowest():
    l=[]
    for i in range(2,11):
        for j in range(0,5):
            
            l.append(income.values[j][i])
    return min(l)
lowest()

36538